/*
Имя файла: T_CREATE.C
Задача   : Формирование структур баз данных
Автор    : Данилов А.И.
Дата     : 14.01.92
Коррекция: Ключников В.А.
Дата     : 20.08.92
*/


#include  <d4basem.h>
#include  <w4m.h>
#include  "dv_sys.h"
#include  "t_create.h"
#include  "d_vaz.h"


#define N_S(n)        ( VAR(fields,n) )
#define N_FIELD(n)    N_S(n), sizeof(N_S(n)), n
#define N_INDEX(n)    ( (char**) VAR(index,n) )


static FIELD  huge fields0[] =       // база 0 - файл датчиков
{
  { "N_DAT_P",    'N',  2,  0, 1 },  //   1 - порядковый намер датчика
  { "K_UPR",      'N',  1,  0, 1 },  //   2 - канал управления
  { "T_DAT",      'N',  2,  0, 0 },  //   3 - тип датчика
  { "T_IZM",      'N',  1,  0, 0 },  //   4 - тип измерителя
  { "NAPR_USO",   'N',  2,  0, 0 },  //   5 - направл.УСО или номер слота
  { "KN_USO",     'N',  2,  0, 0 },  //   6 - канал УСО или номер канала
  { "A",          'N',  8,  4, 0 },  //   7 - коэффициент А
  { "E",          'N',  8,  1, 0 },  //   8 - смещение Е
  { "MIN",        'N',  5,  0, 0 },  //   9 - минимум
  { "MAX",        'N',  5,  0, 0 },  //  10 - максимум
  { "RAZM",       'N',  1,  0, 0 },  //  11 - размерность
  { "PR_ISP",     'N',  1,  0, 0 },  //  12 - признак использования
  { "PR_ISP_PSP", 'N',  1,  0, 0 },  //  13 - признак использования
} ;
static char huge *index0[] =      // индекс
{
   NULL,
} ;


static FIELD  huge fields1[] =       // база 1 - NAGRUZKA
{
  { "N_BLOC",    'N',  2,  0, 0 },  //  номер блока
  { "N_STUP",    'N',  2,  0, 0 },  //  номер ступени
  { "T_KWANT",   'N',  1,  0, 0 },  //  тип кванта
  { "FREC_N",    'N',  7,  1, 0 },  //  частота (начало)
  { "SM_END",    'N',  5,  0, 0 },  //  смещение (конец)
  { "AMPL_DL",   'N',  5,  0, 0 },  //  амплитуда (длительность)
  { "KOL_KWNT",  'N',  5,  0, 0 },  //  количество квантов
  { "KOL_BLOC",  'N',  5,  0, 0 },  //  количество повт. блока
  { "DLIT_OB",   'N', 11,  3, 0 },  //  длительность общая (нарастающая)-сек.
} ;
static char huge *index1[] =      // индекс
{
   NULL,
} ;


static FIELD  huge fields2[] =       // база 2 - PASPORT
{
  // 0-ая страница - Схема нагружения
  { "PR_OBKT1",   'C', 12,  0, 0 },  // признаки об/екта номер 1
                                     // 0 смещение - номер верхнего цилиндра,
                                     // и т.д.
  { "PR_OBKT2",   'C', 12,  0, 0 },  // признаки об/екта номер 2
  { "PR_OBKT3",   'C', 12,  0, 0 },  // признаки об/екта номер 3
  { "PR_OBKT4",   'C', 12,  0, 0 },  // признаки об/екта номер 4
  { "PR_OBKT5",   'C', 12,  0, 0 },  // признаки об/екта номер 5
  { "PR_OBKT6",   'C', 12,  0, 0 },  // признаки об/екта номер 6

  // 1-ая страница - Испытание
  { "I_KOD",      'C',  8,  0, 0 },  // код исп.
  { "I_NOM",      'N',  3,  0, 0 },  // номер
  { "I_TMP",      'N',  4,  1, 0 },  // темпер. воздейств.
  { "I_WLAG",     'N',  4,  1, 0 },  // относит. влажность
  { "I_D_BEG",    'D',  8,  0, 0 },  // дата начала
  { "I_D_END",    'D',  8,  0, 0 },  // дата конца
  { "I_T_BEGCH",  'N',  2,  0, 0 },  // время начала (час)
  { "I_T_BEGM",   'N',  2,  0, 0 },  // время начала (мин)
  { "I_T_BEGS",   'N',  2,  0, 0 },  // время начала (сек)
  { "I_T_ENDCH",  'N',  2,  0, 0 },  // время конца  (час)
  { "I_T_ENDM",   'N',  2,  0, 0 },  // время конца  (мин)
  { "I_T_ENDS",   'N',  2,  0, 0 },  // время конца  (сек)
  { "I_N_MET",    'N',  2,  0, 0 },  // номер методики (внутренний)-характер.
  { "I_N_MET1",   'N',  2,  0, 0 },  // номер методики на экране
  { "I_SHIFR_M",  'C', 12,  0, 0 },  // шифр методики
  { "I_NAME1",    'C', 41,  0, 0 },  // имя 1
  { "I_NAME2",    'C', 41,  0, 0 },  // имя 2
  { "I_DLITCH",   'N',  3,  0, 0 },  // длительность (час)
  { "I_DLITM",    'N',  2,  0, 0 },  // длительность (мин)
  { "I_DLITS",    'N',  2,  0, 0 },  // длительность (сек)

  // 2-ая страница - Об'ект
  { "O_KOD",      'C', 33,  0, 0 },  // код об'екта
  { "O_NOM1",     'C', 33,  0, 0 },  // номер об'екта 1
  { "O_NOM2",     'C', 33,  0, 0 },  // номер об'екта 2
  { "O_NOM3",     'C', 33,  0, 0 },  // номер об'екта 3
  { "O_NOM4",     'C', 17,  0, 0 },  // номер об'екта 4
  { "O_NOM5",     'C', 17,  0, 0 },  // номер об'екта 5
  { "O_NOM6",     'C', 17,  0, 0 },  // номер об'екта 6
  { "O_PART",     'N',  2,  0, 0 },  // партия
  { "O_KOL",      'N',  2,  0, 0 },  // кол-во
  { "O_NAME",     'C', 41,  0, 0 },  // имя
  { "O_CHERT",    'C', 28,  0, 0 },  // чертеж (номер)
  { "O_D_CH",     'D',  8,  0, 0 },  // дата чертежа
  { "O_D_CH_IZ",  'D',  8,  0, 0 },  // дата изменения чертежа
  { "O_OTLICH_B", 'C', 49,  0, 0 },  // отличие от базы
  { "O_KONT",     'C', 13,  0, 0 },  // контроль изготовления
  { "O_KONT_DT",  'D',  8,  0, 0 },  // дата контроля изготовл.
  { "O_ANAL",     'C', 13,  0, 0 },  // анализ матер.
  { "O_ANAL_DT",  'D',  8,  0, 0 },  // дата анализа материала
  { "O_OTKL_CH",  'C', 48,  0, 0 },  // откл. от чертежа
  { "N_KAN",      'N',  1,  0, 0 },  // номер канала
  { "N_KAN2",     'N',  1,  0, 0 },  //    - " -
  { "N_KAN3",     'N',  1,  0, 0 },  //    - " -
  { "N_KAN4",     'N',  1,  0, 0 },  //    - " -
  { "N_KAN5",     'N',  1,  0, 0 },  //    - " -
  { "N_KAN6",     'N',  1,  0, 0 },  //    - " -

  // 3-ая страница - Нагрузки
  { "N_UPRAWL",   'N',  1,  0, 0 },  // управление
  { "N_PARAM",    'N',  1,  0, 0 },  // параметр
  { "N_FILE_ZAD", 'C', 12,  0, 0 },  // файл задания
  { "N_KOL",      'N',  2,  0, 0 },  // количество
  { "N_PARAM2",   'N',  1,  0, 0 },  // параметр
  { "N_FILE_ZD2", 'C', 12,  0, 0 },  // файл задания
  { "N_KOL2",     'N',  2,  0, 0 },  // количество
  { "N_PARAM3",   'N',  1,  0, 0 },  // параметр
  { "N_FILE_ZD3", 'C', 12,  0, 0 },  // файл задания
  { "N_KOL3",     'N',  2,  0, 0 },  // количество
  { "N_PARAM4",   'N',  1,  0, 0 },  // параметр
  { "N_FILE_ZD4", 'C', 12,  0, 0 },  // файл задания
  { "N_KOL4",     'N',  2,  0, 0 },  // количество
  { "N_PARAM5",   'N',  1,  0, 0 },  // параметр
  { "N_FILE_ZD5", 'C', 12,  0, 0 },  // файл задания
  { "N_KOL5",     'N',  2,  0, 0 },  // количество
  { "N_PARAM6",   'N',  1,  0, 0 },  // параметр
  { "N_FILE_ZD6", 'C', 12,  0, 0 },  // файл задания
  { "N_KOL6",     'N',  2,  0, 0 },  // количество

  // ручной режим
  { "NR_MAX",     'N',  5,  0, 0 },  // макс. знач. пар. управл.
  { "NR_MIN",     'N',  5,  0, 0 },  // мин. знач. пар. управл.
  { "NR_DLITM",   'N',  2,  0, 0 },  // длит. испытания (m)
  { "NR_DLITS",   'N',  2,  0, 0 },  // длит. испытания (c)

  // режим от функцианального генератора
  { "NF_UST_WH2", 'N',  4,  1, 0 },  // уставка верх 2
  { "NF_UST_WH1", 'N',  4,  1, 0 },  // уставка верх 1
  { "NF_UST_NZ1", 'N',  4,  1, 0 },  // уставка низ 1
  { "NF_UST_NZ2", 'N',  4,  1, 0 },  // уставка низ 2
  { "NF_TIME_K",  'N',  4,  1, 0 },  // время контроля
  { "NF_KOL_PIC", 'N',  2,  0, 0 },  // кол-во пиков

  // сегментный режим
  { "NG_MAX",     'N',  5,  0, 0 },  // макс. знач. пар. упр-ия
  { "NG_MIN",     'N',  5,  0, 0 },  // мин. знач. пар. упр-ия
  { "NG_DLITM",   'N',  2,  0, 0 },  // длительность исп.(мин)
  { "NG_DLITS",   'N',  2,  0, 0 },  // длительность исп.(сек)
  { "NG_UST_WH1", 'N',  4,  1, 0 },  // уставка верх 1
  { "NG_UST_NZ1", 'N',  4,  1, 0 },  // уставка низ 1

  // программный режим
  { "NP_UST_WH2", 'N',  4,  1, 0 },  // уставка верх 2
  { "NP_UST_WH1", 'N',  4,  1, 0 },  // уставка верх 1
  { "NP_UST_NZ1", 'N',  4,  1, 0 },  // уставка низ 1
  { "NP_UST_NZ2", 'N',  4,  1, 0 },  // уставка низ 1

  // специальнoe управление
  { "NS_PARUPR1", 'N',  1,  0, 0 },  // парам. упр. фазы 1
  { "NS_PARUPR2", 'N',  1,  0, 0 },  // парам. упр. фазы 2
  { "NS_N_ZN1",   'N',  4,  1, 0 },  // нач. значен. фазы 1
  { "NS_N_ZN2",   'N',  4,  1, 0 },  // нач. значен. фазы 2
  { "NS_SKOR1",   'N',  5,  1, 0 },  // скорость изм.фазы 1
  { "NS_SKOR2",   'N',  5,  1, 0 },  // скорость изм.фазы 2
  { "NS_K_ZN1",   'N',  6,  1, 0 },  // кон. знач. фазы 1
  { "NS_K_ZN2",   'N',  6,  1, 0 },  // кон. знач. фазы 2
  { "NS_SN_NG1",  'N',  2,  0, 0 },  // сниж. нагр. фазы 1
  { "NS_SN_NG2",  'N',  2,  0, 0 },  // сниж. нагр. фазы 2
  { "NS_PARAM_P", 'N',  1,  0, 0 },  // параметр перехода
  { "NS_KRIT_ZN", 'N',  4,  0, 0 },  // критеческ. значение
  { "NS_KRIT_SK", 'N',  3,  1, 0 },  // крит. уров. скорости (относ. ур. снижен.)
  { "NS_KONT_N",  'N',  1,  0, 0 },  // парам. контроля нагр.
  { "NS_PRED_ZN", 'N',  4,  2, 0 },  // предельное значение
  { "NS_UST1",    'N',  2,  0, 0 },  // уставка 1 (уст. 1 верх)
  { "NS_UST2",    'N',  2,  0, 0 },  // уставка 2 (уст. 1 низ)
  { "NS_UST3",    'N',  2,  0, 0 },  // уставка 3 (уст. 2 верх)
  { "NS_UST4",    'N',  2,  0, 0 },  // уставка 4 (уст. 2 низ)

  // информация для испытания образцов материала
  { "NM_SL_ED_I", 'N',  1,  0, 0 },  // единицы измерения силы
  { "NM_SL_SHK",  'N', 10,  3, 0 },  // шкала измерения
  { "NM_PR_ED_I", 'N',  1,  0, 0 },  // единицы измерения перемещ.
  { "NM_PR_SHK",  'N', 10,  3, 0 },  // шкала измерения
  { "NM_DF_ED_I", 'N',  1,  0, 0 },  // единицы измерения деформац.
  { "NM_DF_SHK",  'N', 10,  3, 0 },  // шкала измерения
  { "NM_NP_ED_I", 'N',  1,  0, 0 },  // единицы измерения напряжения
  { "NM_NP_SHK",  'N', 10,  3, 0 },  // шкала измерения
  { "NM_TM_ED_I", 'N',  1,  0, 0 },  // единицы измереная силы
  { "NM_TM_SHK",  'N',  3,  0, 0 },  // шкала измерения

  { "NM_TOLSH",   'N',  6,  2, 0 },  // толщина
  { "NM_SHIR",    'N',  6,  2, 0 },  // ширина
  { "NM_DIAM",    'N',  6,  2, 0 },  // диаметр
  { "NM_BAZA",    'N',  6,  2, 0 },  // база экстензометра


  // 4-ая страница - сбор информации
  { "S_KANAL",    'N',  1,  0, 0 },  // номер канала
  { "S_TTEK_PM",  'N',  2,  0, 0 },  // период текущего протокола(м)
  { "S_TTEK_PS",  'N',  2,  0, 0 },  // период текущего протокола(с)
  { "S_DAT1",     'N',  2,  0, 0 },  // номер датчика 1
  { "S_DAT2",     'N',  2,  0, 0 },  // номер датчика 2
  { "S_DAT3",     'N',  2,  0, 0 },  // номер датчика 3
  { "S_DAT4",     'N',  2,  0, 0 },  // номер датчика 4
  { "S_DAT5",     'N',  2,  0, 0 },  // номер датчика 5
  { "S_DAT6",     'N',  2,  0, 0 },  // номер датчика 6
  { "S_DAT7",     'N',  2,  0, 0 },  // номер датчика 7
  { "S_DAT8",     'N',  2,  0, 0 },  // номер датчика 8
  { "S_DAT9",     'N',  2,  0, 0 },  // номер датчика 9
  { "S_DAT10",    'N',  2,  0, 0 },  // номер датчика 10

  // 5-ая страница - Замечания
  { "Z_OBEKT",    'C', 47,  0, 0 },  // обект
  { "Z_NAGRUZKA", 'C', 45,  0, 0 },  // нагрузка
  { "Z_SB_INF",   'C', 45,  0, 0 },  // сбор информации
  { "Z_STEND",    'C', 47,  0, 0 },  // стенд
  { "Z_OPERATOR", 'C', 50,  0, 0 },  // имя

  // амплитудно-частотная характеристика
  { "AH_PAR_UPR", 'N',  1,  0, 0 },  // Параметр управления
  { "AH_SR_ZN",   'N',  5,  0, 0 },  // Среднее значение в цикле
  { "AH_AMPL_C",  'N',  4,  0, 0 },  // Амплитуда цикла
  { "AH_BEG_C",   'N',  4,  1, 0 },  // Начальная частота циклов
  { "AH_END_C",   'N',  4,  1, 0 },  // Конечная частота циклов
  { "AH_SH_CH_F", 'N',  4,  1, 0 },  // Шаг изменения частоты
                                     // Количество зачетных циклов на
  { "AH_Z_CIKL",  'N',  3,  0, 0 },  //         каждом уровне частоты
  { "AH_P_K_NG",  'N',  1,  0, 0 },  // Параметр контроля нагрузки
                                     // Предельное значение:
  { "AH_PR_Z_W",  'N',  9,  1, 0 },  // верхнее
  { "AH_PR_Z_N",  'N',  9,  1, 0 },  // нижнее
  { "AH_UST1",    'N',  2,  0, 0 },  // Уставка 1, %   управления
  { "AH_UST2",    'N',  2,  0, 0 },  // Уставка 2, %
  { "AH_UST3",    'N',  2,  0, 0 },  // Уставка 3, %
  { "AH_UST4",    'N',  2,  0, 0 },  // Уставка 4, %

  { "AH_UST1_",   'N',  2,  0, 0 },  // Уставка 1, %   контроля
  { "AH_UST2_",   'N',  2,  0, 0 },  // Уставка 2, %
  { "AH_UST3_",   'N',  2,  0, 0 },  // Уставка 3, %
  { "AH_UST4_",   'N',  2,  0, 0 },  // Уставка 4, %


  // характеристика статической жесткости
  { "SG_PR_UPR",  'N',  1,  0, 0 },  // параметр управления (0-сила, 1-перемещ.)
  { "SG_BG_ZN",   'N',  7,  1, 0 },  // начальное значение
  { "SG_TIM_WP",  'N',  3,  0, 0 },  // Время наростания
  { "SG_MX_ZM",   'N',  7,  1, 0 },  // максимальное значение
  { "SG_TIM_WX",  'N',  3,  0, 0 },  // Время выдержки
  { "SG_MN_ZN",   'N',  7,  1, 0 },  // Минимальное значение
  { "SG_TIM_NZ",  'N',  3,  0, 0 },  // Время снижения
  { "SG_TIM_WN",  'N',  3,  0, 0 },  // Время выдержки
  { "SG_KL_Z_C",  'N',  2,  0, 0 },  // кол-во зачетных циклов

  { "SG_UST1_N",  'N',  2,  0, 0 },  // Уставка 1, % (верх предупр.) Для нагрузки
  { "SG_UST2_N",  'N',  2,  0, 0 },  // Уставка 2, % (верх авария)
  { "SG_UST3_N",  'N',  2,  0, 0 },  // Уставка 3, % (низ предупр.)
  { "SG_UST4_N",  'N',  2,  0, 0 },  // Уставка 4, % (низ авария)

  { "SG_PAR_KN",  'N',  1,  0, 0 },  // параметр контроля нагрузки
                                     // 0 - перемещ.
                                     // 1 - деформ. 1
                                     // 2 - деформ. 2
  { "SG_PR_Z_W",  'N',  5,  1, 0 },  // предельное значение ампл.
//  { "SG_PR_Z_N",  'N',  1,  0, 0 },  // предельное значение нижнее

  { "SG_UST1",    'N',  2,  0, 0 },  // Уставка 1, % (верх предупр.)
  { "SG_UST2",    'N',  2,  0, 0 },  // Уставка 2, % (верх авария)
  { "SG_UST3",    'N',  2,  0, 0 },  // Уставка 3, % (низ предупр.)
  { "SG_UST4",    'N',  2,  0, 0 },  // Уставка 4, % (низ авария)


  // характеристика циклической жесткости
  // характеристика циклической долговечности
  // характеристика блок-циклической долговечности
  { "CG_PR_UPR",  'N',  1,  0, 0 },  // параметр управления (0-сила, 1-перемещ.)
  { "CG_TIP_W",   'N',  1,  0, 0 },  // тип воздействия ( 0-синис, 1-пила)
  { "CG_AMPL",    'N',  6,  1, 0 },  // амплитуда
  { "CG_POST_S",  'N',  7,  1, 0 },  // постоянная составляющая
  { "CG_FREQ",    'N',  5,  2, 0 },  // частота
  { "CG_KL_Z_C",  'N',  9,  0, 0 },  // кол-во зачетных циклов

  { "CG_UST1_N",  'N',  2,  0, 0 },  // Уставка 1, % (верх предупр.) Для нагрузки
  { "CG_UST2_N",  'N',  2,  0, 0 },  // Уставка 2, % (верх авария)
  { "CG_UST3_N",  'N',  2,  0, 0 },  // Уставка 3, % (низ предупр.)
  { "CG_UST4_N",  'N',  2,  0, 0 },  // Уставка 4, % (низ авария)

  { "CG_PAR_KN",  'N',  1,  0, 0 },  // параметр контроля нагрузки
                                     // 0 - перемещ.
                                     // 1 - деформ. 1
                                     // 2 - деформ. 2
  { "CG_PR_Z_W",  'N',  9,  3, 0 },  // предельное значение ампл.

  { "CG_UST1",    'N',  2,  0, 0 },  // Уставка 1, % (верх предупр.)
  { "CG_UST2",    'N',  2,  0, 0 },  // Уставка 2, % (верх авария)
  { "CG_UST3",    'N',  2,  0, 0 },  // Уставка 3, % (низ предупр.)
  { "CG_UST4",    'N',  2,  0, 0 },  // Уставка 4, % (низ авария)


  //  характеристика вязкого демпфирования
  { "WD_PAR_UPR", 'N',  1,  0, 0 },  // Параметр управления
  { "WD_VID_NG",  'N',  1,  0, 0 },  // Вид нагружения           - new
                                     // ( 0 - синус, 1-пила )
  { "WD_BEG_ZN",  'N',  7,  1, 0 },  // Начальное значение  ???? - old

  { "WD_PER_SG",  'N',  7,  1, 0 },  // Значение перем. сжатия   - new
  { "WD_PER_OT",  'N',  7,  1, 0 },  // Значение перем. отбоя    - new

  { "WD_MAX_ZN",  'N',  7,  1, 0 },  // Максимальное значение
  { "WD_MIN_ZN",  'N',  7,  1, 0 },  // Минимальное значение

  { "WD_BEG_SK",  'N',  7,  1, 0 },  // Начальная скорость
  { "WD_END_SK",  'N',  7,  1, 0 },  // Конечная скорость
  { "WD_SHG_SKR", 'N',  6,  1, 0 },  // Шаг изменения скорости

  { "WD_K_Z_CKL", 'N',  2,  0, 0 },  // Кол. зачетн. циклов на каждом шаге

  { "WD_PR_K_N",  'N',  1,  0, 0 },  // параметр контроля нагрузки
  { "WD_PR_Z_W",  'N',  6,  1, 0 },  // предельное знач. верхнее
  { "WD_PR_Z_N",  'N',  6,  1, 0 },  // предельное знач. нижнее

  { "WD_UST1",    'N',  2,  0, 0 },  // Уставка 1, %
  { "WD_UST2",    'N',  2,  0, 0 },  // Уставка 2, %
  { "WD_UST3",    'N',  2,  0, 0 },  // Уставка 3, %
  { "WD_UST4",    'N',  2,  0, 0 },  // Уставка 4, %

  // *************  временное размещение - затем в дополнительном файле
  // !!! изменения ОБЯЗАТЕЛЬНО проводить в двух файлах
  { "SU_PAR_UPR", 'N',  1,  0, 0 },  // параметр управления (0-сила, 1-перемщ.)
  { "SU_TIP_WZD", 'N',  1,  0, 0 },  // тип воздействия (0-синис, 1-пила.)
  { "SU_AMPL",    'N',  6,  1, 0 },  // амплитуда
  { "SU_PST_SST", 'N',  7,  1, 0 },  // посточнная соствляющая
  { "SU_FREQ",    'N',  5,  2, 0 },  // частота
  { "SU_K_Z_CKL", 'N',  8,  0, 0 },  // кол-во зачетных циклов

  { "SU_UST_U1",  'N',  2,  0, 0 },  // уставка 1 управления (верх пред.) %
  { "SU_UST_U2",  'N',  2,  0, 0 },  // уставка 2 управления (верх авар.) %
  { "SU_UST_U3",  'N',  2,  0, 0 },  // уставка 3 управления (низ пред.), %
  { "SU_UST_U4",  'N',  2,  0, 0 },  // уставка 4 управления (низ авар.), %

  { "SU_PAR_KNT", 'N',  1,  0, 0 },  // параметр контроля нагрузки
                                     // 0 - Перемещение
                                     // 1 - Деформация 1
                                     // 2 - Деформация 2
  { "SU_PRED_ZN", 'N',  5,  1, 0 },  // предельное значение

  { "SU_UST_K1",  'N',  2,  0, 0 },  // уставка 1 контроля (верх пред.) %
  { "SU_UST_K2",  'N',  2,  0, 0 },  // уставка 2 контроля (верх авар.) %
  { "SU_UST_K3",  'N',  2,  0, 0 },  // уставка 3 контроля (низ пред.), %
  { "SU_UST_K4",  'N',  2,  0, 0 },  // уставка 4 контроля (низ авар.), %
  // ***********


  // расчетные величины (характеристика статической прочности)
  // заполняются после испытания
  { "R_FL_RCH",   'N',  1,  0, 0 },  //  пров. расч.(1) или нет (0)

  { "A_SM",       'N',  8,  3, 0 },  //  А для смещения
  { "B_SM",       'N',  6,  4, 0 },  //  В для смещения
  { "A_NAGR",     'N',  8,  2, 0 },  //  А для напряжения
  { "B_NAGR",     'N',  6,  2, 0 },  //  В для напряжения

  { "R_K_WIDTH",  'N',  6,  2, 0 },  //  конечн. ширина
  { "R_K_TOL",    'N',  6,  2, 0 },  //  конечн. толщина
  { "R_K_DIAM",   'N',  6,  2, 0 },  //  конечн. диаметр
  { "R_K_DLIN",   'N',  6,  2, 0 },  //  конечн. длина

  { "R_PRI_END",  'N',  2,  0, 0 },  //  причина окончания исп.

} ;
static char huge *index2[] =      // индекс
{
   NULL,
} ;


static FIELD  huge fields3[] =       // база 3 - стат. обработка
  /*
   Внимание !!! - изменение полей общих с паспортом проводить
   одновременно в двух базах
  */
{
  { "R_ZAG1",     'C', 12,  0, 0 },  //      заголовок 1
  { "R_ZAG2",     'C',  7,  0, 0 },  //      заголовок 2

  { "O_KOD",      'C', 33,  0, 0 },  //      код об'екта
  { "O_NOM1",     'C', 33,  0, 0 },  //      номер об'екта 1
  { "O_NOM2",     'C', 33,  0, 0 },  //      номер об'екта 2
  { "O_NAME",     'C', 41,  0, 0 },  //      имя
  { "I_SHIFR_M",  'C', 12,  0, 0 },  //      шифр методики
  { "KOD_ISP",    'C', 12,  0, 0 },  //      код об'екта
  { "N_PARAM",    'N',  1,  0, 0 },  //      параметр
  { "Z_OPERATOR", 'C', 50,  0, 0 },  //      имя

  { "R_ZAM_NPR1", 'C', 17,  0, 0 },  //      зона замера напр. 1
  { "R_ZAM_NPR2", 'C', 17,  0, 0 },  //      зона замера напр. 2
  { "R_ZAM_DEF1", 'C', 17,  0, 0 },  //      зона замера деф. 1
  { "R_ZAM_DEF2", 'C', 17,  0, 0 },  //      зона замера деф. 2

  { "R_PRI_END",  'N',  2,  0, 0 },  //      причина окончания исп.

  { "A_SM",       'N',  8,  3, 0 },  //      А для смещения
  { "B_SM",       'N',  6,  4, 0 },  //      В для смещения
  { "A_NAGR",     'N',  8,  2, 0 },  //      А для напряжения
  { "B_NAGR",     'N',  6,  2, 0 },  //      В для напряжения


  { "R_PR_PR_N",  'N',  6,  2, 0 },  //      предел прочности (напр.)
  { "R_PR_PR_D",  'N',  6,  4, 0 },  //      предел прочности (деф.)
  { "R_PR_TW_N",  'N',  6,  2, 0 },  //      предел тек. верхн. (напр.)
  { "R_PR_TW_D",  'N',  6,  4, 0 },  //      предел тек. верхн. (деф.)
  { "R_PR_TN_N",  'N',  6,  2, 0 },  //      предел тек. нижн. (напр.)
  { "R_PR_TN_D",  'N',  6,  4, 0 },  //      предел тек. нижн. (деф.)
  { "R_PR_PRP_N", 'N',  6,  2, 0 },  //      предел пропорц. (напр.)
  { "R_PR_PRP_D", 'N',  6,  4, 0 },  //      предел пропорц. (деф.)
  { "R_M_UPR_P",  'N',  9,  2, 0 },  //      модуль упруг. - первичн.
  { "R_M_UPR_W",  'N',  9,  2, 0 },  //      модуль упруг. - вторичн.
  { "R_B_P",      'N',  9,  2, 0 },  //      коэфф. для расч. прям. перв.
  { "R_B_W",      'N',  9,  2, 0 },  //      коэфф. для расч. прям. втор.
  { "R_K_KOR_P",  'N',  6,  3, 0 },  //      коэфф. коррел. - первичн.
  { "R_K_KOR_W",  'N',  6,  3, 0 },  //      коэфф. коррел. - втор.
  { "R_RD_MAX_P", 'N',  6,  2, 0 },  //      расч. диап. - макс. (перв.)
  { "R_RD_MAX_W", 'N',  6,  2, 0 },  //      расч. диап. - макс. (втор.)
  { "R_RD_MIN_P", 'N',  6,  2, 0 },  //      расч. диап. - мин. ( перв.)
  { "R_RD_MIN_W", 'N',  6,  2, 0 },  //      расч. диап. - мин. ( втор.)
  { "R_RD_KT_P",  'N',  4,  0, 0 },  //      расч. диап. - кол. точек (перв.)
  { "R_RD_KT_W",  'N',  4,  0, 0 },  //      расч. диап. - кол. точек (втор.)_
  { "R_O_DF_O_P", 'N',  4,  2, 0 },  //      остаточн. деф. - относит. вел-на (перв.)
  { "R_O_DF_N_P", 'N',  6,  2, 0 },  //      ост. деф. - напр. (перв.)
  { "R_O_DF_D_P", 'N',  6,  4, 0 },  //      ост. деф. - деф. (перв.)
  { "R_O_DF_O_W", 'N',  4,  2, 0 },  //      остаточн. деф. - относит. вел-на (втор.)
  { "R_O_DF_N_W", 'N',  6,  2, 0 },  //      ост. деф. - напр. (втор.)
  { "R_O_DF_D_W", 'N',  6,  4, 0 },  //      ост. деф. - деф. (втор.)

  { "R_O_UDL",    'N',  5,  1, 0 },  //      относит. удлен.
  { "R_O_SUGEN",  'N',  5,  1, 0 },  //      относительн. сужен.

  { "NM_TOLSH",   'N',  6,  2, 0 },  //      толщина
  { "NM_SHIR",    'N',  6,  2, 0 },  //      ширина
  { "NM_DIAM",    'N',  6,  2, 0 },  //      диаметр
  { "NM_BAZA",    'N',  6,  2, 0 },  //      база экстензометра

  { "R_K_WIDTH",  'N',  6,  2, 0 },  //      конечн. ширина
  { "R_K_TOL",    'N',  6,  2, 0 },  //      конечн. толщина
  { "R_K_DIAM",   'N',  6,  2, 0 },  //      конечн. диаметр
  { "R_K_DLIN",   'N',  6,  2, 0 },  //      конечн. длина

  { "R_T_N1",     'N',  6,  2, 0 },  //      коорд. точки 1 (напр.)
  { "R_T_D1",     'N',  6,  4, 0 },  //      коорд. точки 1 (деф.)
  { "R_T_N2",     'N',  6,  2, 0 },  //          -"-      2 (напр.)
  { "R_T_D2",     'N',  6,  4, 0 },  //          -"-      2 (деф.)
  { "R_T_N3",     'N',  6,  2, 0 },  //          -"-      3 (напр.)
  { "R_T_D3",     'N',  6,  4, 0 },  //          -"-      3 (деф.)
  { "R_T_N4",     'N',  6,  2, 0 },  //          -"-      4 (напр.)
  { "R_T_D4",     'N',  6,  4, 0 },  //          -"-      4 (деф.)
  { "R_T_N5",     'N',  6,  2, 0 },  //          -"-      5 (напр.)
  { "R_T_D5",     'N',  6,  4, 0 },  //          -"-      5 (деф.)

} ;
static char huge *index3[] =      // индекс
{
   NULL,
} ;



static FIELD  huge fields5[] =       // база 5 - амплитудно-част.
  /*
   Внимание !!! - изменение полей общих с паспортом проводить
   одновременно в двух базах
  */
{
  { "R_ZAG1",     'C', 12,  0, 0 },  //      заголовок 1
  { "R_ZAG2",     'C',  7,  0, 0 },  //      заголовок 2

  { "O_KOD",      'C', 33,  0, 0 },  //      код об'екта
  { "O_NOM1",     'C', 33,  0, 0 },  //      номер об'екта 1
  { "O_NOM2",     'C', 33,  0, 0 },  //      номер об'екта 2
  { "O_NAME",     'C', 41,  0, 0 },  //      имя
  { "I_SHIFR_M",  'C', 12,  0, 0 },  //      шифр методики
  { "KOD_ISP",    'C', 12,  0, 0 },  //      код об'екта
  { "N_PARAM",    'N',  1,  0, 0 },  //      параметр
  { "Z_OPERATOR", 'C', 50,  0, 0 },  //      имя

  { "R_ZAM_NPR1", 'C', 17,  0, 0 },  //      зона замера напр. 1
  { "R_ZAM_NPR2", 'C', 17,  0, 0 },  //      зона замера напр. 2
  { "R_ZAM_DEF1", 'C', 17,  0, 0 },  //      зона замера деф. 1
  { "R_ZAM_DEF2", 'C', 17,  0, 0 },  //      зона замера деф. 2

  { "R_PRI_END",  'N',  2,  0, 0 },  //      причина окончания исп.
  { "S_KANAL",    'N',  1,  0, 0 },  //      номер канала, по которому снималась
                                     //      информация
  { "AH_PAR_UPR", 'N',  1,  0, 0 },  //      Параметр управления
  { "AH_SR_ZN",   'N',  5,  0, 0 },  //      Среднее значение в цикле
  { "AH_AMPL_C",  'N',  4,  0, 0 },  //      Амплитуда цикла
  { "AH_SMAX",    'N',  4,  0, 0 },  //      Максимум

} ;
static char huge *index5[] =      // индекс
{
   NULL,
} ;

static FIELD  huge fields6[] =       // база 6 - вязкого-демпфирования
  /*
   Внимание !!! - изменение полей общих с паспортом проводить
   одновременно в двух базах
  */
{

  { "R_ZAG1",     'C', 12,  0, 0 },  //   заголовок 1
  { "R_ZAG2",     'C',  7,  0, 0 },  //   заголовок 2

  { "O_KOD",      'C', 33,  0, 0 },  //   код об'екта
  { "O_NOM1",     'C', 33,  0, 0 },  //   номер об'екта 1
  { "O_NOM2",     'C', 33,  0, 0 },  //   номер об'екта 2
  { "O_NAME",     'C', 41,  0, 0 },  //   имя
  { "I_SHIFR_M",  'C', 12,  0, 0 },  //   шифр методики
  { "KOD_ISP",    'C', 12,  0, 0 },  //   код об'екта
  { "N_PARAM",    'N',  1,  0, 0 },  //   параметр
  { "Z_OPERATOR", 'C', 50,  0, 0 },  //   имя

  { "R_ZAM_NPR1", 'C', 17,  0, 0 },  //   зона замера напр. 1
  { "R_ZAM_NPR2", 'C', 17,  0, 0 },  //   зона замера напр. 2
  { "R_ZAM_DEF1", 'C', 17,  0, 0 },  //   зона замера деф. 1
  { "R_ZAM_DEF2", 'C', 17,  0, 0 },  //   зона замера деф. 2

  { "R_PRI_END",  'N',  2,  0, 0 },  //   причина окончания исп.


  { "WD_PAR_UPR", 'N',  1,  0, 0 },  //   Параметр управления
  { "WD_VID_NG",  'N',  1,  0, 0 },  //   Вид нагружения           - new
                                     //   ( 0 - синус, 1-пила )
  { "WD_BEG_ZN",  'N',  7,  1, 0 },  //   Начальное значение  ???? - old

  { "WD_PER_SG",  'N',  7,  1, 0 },  //   Значение перем. сжатия   - new
  { "WD_PER_OT",  'N',  7,  1, 0 },  //   Значение перем. отбоя    - new
  { "WD_MAX_ZN",  'N',  7,  1, 0 },  //   Максимальное значение
  { "WD_MIN_ZN",  'N',  7,  1, 0 },  //   Минимальное значение

  { "WD_BEG_SK",  'N',  7,  1, 0 },  //   Начальная скорость
  { "WD_END_SK",  'N',  7,  1, 0 },  //   Конечная скорость

} ;
static char huge *index6[] =      // индекс
{
   NULL,
} ;


/* файл 5 выше */
static FIELD  huge fields4[] =       // база 4 - файл методик
{

  { "I_N_MET",    'N',  2,  0, 0 },  //  номер методики
  { "I_SHIFR_M",  'C', 12,  0, 0 },  //  шифр методики
  { "I_NAME",     'C', 60,  0, 0 },  //  имя 
} ;
static char huge *index4[] =      // индекс
{
   NULL,
} ;



static FIELD  huge fields7[] =       // информация по конфигурированию
{
  { "SLOT*",      'N',  1,  0, 0 },  //  номер слота (0-7) ( SLOT0-SLOT7)
} ;
static char huge *index7[] =      // индекс
{
   NULL,
} ;

// последняя запись данного файла находится в паспорте
// !!! изменения ОБЯЗАТЕЛЬНО проводить в двух файлах
static FIELD  huge fields8[] =       // файл заданий для сопротивления усталости
{
  { "NOM_OB",     'N',  3,  0, 0 },  // номер об'екта
  { "SU_PAR_UPR", 'N',  1,  0, 0 },  // параметр управления (0-сила, 1-перемщ.)
  { "SU_TIP_WZD", 'N',  1,  0, 0 },  // тип воздействия (0-синис, 1-пила.)
  { "SU_AMPL",    'N',  6,  1, 0 },  // амплитуда
  { "SU_PST_SST", 'N',  7,  1, 0 },  // посточнная соствляющая
  { "SU_FREQ",    'N',  5,  2, 0 },  // частота
  { "SU_K_Z_CKL", 'N',  8,  0, 0 },  // кол-во зачетных циклов

  { "SU_UST_U1",  'N',  2,  0, 0 },  // уставка 1 управления (верх пред.) %
  { "SU_UST_U2",  'N',  2,  0, 0 },  // уставка 2 управления (верх авар.) %
  { "SU_UST_U3",  'N',  2,  0, 0 },  // уставка 3 управления (низ пред.), %
  { "SU_UST_U4",  'N',  2,  0, 0 },  // уставка 4 управления (низ авар.), %

  { "SU_PAR_KNT", 'N',  1,  0, 0 },  // параметр контроля нагрузки
                                     // 0 - Перемещение
                                     // 1 - Деформация 1
                                     // 2 - Деформация 2
  { "SU_PRED_ZN", 'N',  5,  1, 0 },  // предельное значение

  { "SU_UST_K1",  'N',  2,  0, 0 },  // уставка 1 контроля (верх пред.) %
  { "SU_UST_K2",  'N',  2,  0, 0 },  // уставка 2 контроля (верх авар.) %
  { "SU_UST_K3",  'N',  2,  0, 0 },  // уставка 3 контроля (низ пред.), %
  { "SU_UST_K4",  'N',  2,  0, 0 },  // уставка 4 контроля (низ авар.), %

  { "PriznIsp",   'N',  4,  0, 0 },  // признак использования ( такой же как
                                     // и в файле данных )
  { "PR_WHY",     'N',  3,  0, 0 },  // признак окончания испытания для
                                     // данного об'екта

  { "SU_KF_SA",   'N',  3,  0, 0 },  // коэффициент А для датчика силы
  { "SU_KF_SB",   'N',  3,  0, 0 },  //   - " -     B   - " -     силы
  { "SU_KF_PA",   'N',  3,  0, 0 },  //   - " -     A   - " -     перемещения
  { "SU_KF_PB",   'N',  3,  0, 0 },  //   - " -     B   - " -     перемещения

  { "SU_KF_D1A",  'N',  3,  0, 0 },  //   - " -     A   - " -     дефорнации 1
  { "SU_KF_D1B",  'N',  3,  0, 0 },  //   - " -     B   - " -     дефорнации 1

  { "SU_KF_D2A",  'N',  3,  0, 0 },  //   - " -     A   - " -     дефорнации 2
  { "SU_KF_D2B",  'N',  3,  0, 0 },  //   - " -     B   - " -     дефорнации 2

  { "SU_PRZ_REG", 'N',  1,  0, 0 },  // признак регистрации для данного
                                     // об'екта

} ;
static char huge *index8[] =      // индекс
{
   NULL,
} ;


STRCT_BASE strct_base[] =
{
  { FILE_DAT,      N_FIELD(0),  N_INDEX(0), NULL },
  { NAGR_FILE,     N_FIELD(1),  N_INDEX(1), NULL },
  { PASPRT_FL,     N_FIELD(2),  N_INDEX(2), NULL },
  { PRF_ST_OB,     N_FIELD(3),  N_INDEX(3), NULL },
  { METODIKA_FILE, N_FIELD(4),  N_INDEX(4), NULL },
  { PRF_ACH,       N_FIELD(5),  N_INDEX(5), NULL },
  { PRF_WD,        N_FIELD(6),  N_INDEX(6), NULL },
  { UST_CNFG,      N_FIELD(7),  N_INDEX(7), NULL },
  { ADD_SP_UST,    N_FIELD(8),  N_INDEX(8), NULL },
} ;


/* функция создания структуры файла по номеру структуры,
   file_name - реальное имя получаемой базы данных */
int f_create( char *file_name, int num )
{
  int    kol_fields ;
  FIELD *pt_field ;
  int    out ;
  int kol_repeat ;

  t_cr_define_param(num, &pt_field, &kol_fields ) ;

  if ( (kol_repeat = base_is_repeat( num ) ) == 0 )  // не "размножаемая" база
      out = d4create(file_name, kol_fields, pt_field, 1 ) ;
  else
      out = create_repeat( kol_repeat, pt_field,  kol_fields,  file_name ) ;
  d4unlock(-1) ;

  return out ;
}


int base_is_repeat( int num )
/*
   Функция возвращает кол-во размножений для структуры n ( число у переменных
   fields и index )
   Эта функция обязательна ( она вызывается функцией проверки структуры
   существующей базы со структурой в t_create.c )
   Если все структуры файлов не "размножаемые", то тело функции  { return 0 }
   Если есть структуры "размножаемые", то см. пример в системе MVZ (t_create.c)
*/
{
  int kol_repeat=0 ;

  // Строка необходима для уменьшения памяти библиотеки - обязательна в теле
  // данной функции, если есть "размножаемые" структуры.
  // Позволяет не прилинковывать модуль формиров. "размножаемых" структур
  // при проверке структуры открываемой базы.
  func_repeat = cr_define_repeat ;

  if ( num == 7 ) {
     kol_repeat        = 8 ;
     beg_number_repeat = 0 ; // начальный индекс у размножаемого поля (default-1)
  }

  return kol_repeat ;
}


// EOF:T_CREATE.C
